### Task 1
The `bank.csv` data set describes telephone contacts made with customers of a certain bank in order to convince them to take advantage of the new offer of that bank. Based on the data contained in the dataset, answer the following questions:

1. In which month were the most calls made (and the least)?
2. In which month was the longest average talk time?
3. Does education affect savings? (`balance` column)
4. How old was the oldest married person and how old was the oldest single?

In [1]:
import pandas as pd

df = pd.read_csv('datasets/bank.csv', sep=';')
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226

Ad. 1.

In [2]:
months = df['month'].value_counts().sort_values(ascending=False)
print(months)
print('The most calls were made in: ', months.idxmax())
print('The least calls were made in: ', months.idxmin())

may    1398
jul     706
aug     633
jun     531
nov     389
apr     293
feb     222
jan     148
oct      80
sep      52
mar      49
dec      20
Name: month, dtype: int64
The most calls were made in:  may
The least calls were made in:  dec

Ad. 2.

In [3]:
avg_duration_in_month = df.groupby(by='month')['duration'].mean()
print('The longest average talk time was in: ', avg_duration_in_month.idxmax())

The longest average talk time was in:  dec

Ad. 3.

In [4]:
df['balance'].hasnans or df['education'].hasnans

False

In [5]:
df[['education','balance']].groupby(by='education').agg(['count','mean','sum','min','max','std'])

          balance
            count         mean      sum   min    max          std
education
primary       678  1411.544248   957027  -966  71188  3713.755021
secondary    2306  1196.814397  2759854 -2082  26452  2419.704664
tertiary     1350  1775.423704  2396822 -3313  42045  3460.615109
unknown       187  1701.245989   318133  -715  21244  2981.380992

Ad. 4.

In [6]:
df[['age','marital']].groupby('marital').max()

          age
marital
divorced   84
married    87
single     69

The oldest married person was 87 years old.\
The oldest single person was 69 years old.